# Pandas- Is a library in python used for data manipulation.

In [8]:
# Installation of Pandas

!pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [10]:
import pandas as pd

In [18]:
series1 = pd.Series([1,2,'Amit',4,5])
series1

0       1
1       2
2    Amit
3       4
4       5
dtype: object

In [26]:
# Data Frame- df- Contains multiple rows and columns like CSV, xlxs, ets.,.
sample_df= pd.DataFrame({'id':[101,102,103],'name':['Amit', 'Deepak','Yasha'],'age':[34,23,45]})
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  103   Yasha   45

In [28]:
sample_df.loc[len(sample_df.index)]=[104,'Mohan',38] # Adding new data rows
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  103   Yasha   45
3  104   Mohan   38

In [30]:
len(sample_df.index) # To find length of the index

4

In [32]:
sample_df.age.dtype # To find datatype

dtype('int64')

In [36]:
sample_df.name.dtype

dtype('O')

In [38]:
sample_df.age.mean() # To find mean value

35.0

In [40]:
sample_df.describe() # To find discription of the table

               id        age
count    4.000000   4.000000
mean   102.500000  35.000000
std      1.290994   9.201449
min    101.000000  23.000000
25%    101.750000  31.250000
50%    102.500000  36.000000
75%    103.250000  39.750000
max    104.000000  45.000000

In [42]:
sample_df.describe().T # To change view

     count   mean       std    min     25%    50%     75%    max
id     4.0  102.5  1.290994  101.0  101.75  102.5  103.25  104.0
age    4.0   35.0  9.201449   23.0   31.25   36.0   39.75   45.0

In [44]:
sample_df.shape           # To find shape of the table

(4, 3)

In [46]:
sample_df.head(2)         # To find top 2 rows only

    id    name  age
0  101    Amit   34
1  102  Deepak   23

In [48]:
sample_df.tail(2)            # To find bottom 2 rows only

    id   name  age
2  103  Yasha   45
3  104  Mohan   38

In [50]:
sample_df.info()           # Inforamtion of the table

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   name    4 non-null      object
 2   age     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [96]:
d= {'id': 105,'name':'Raghu','age': 35}
d

{'id': 105, 'name': 'Raghu', 'age': 35}

In [102]:
sample_df= sample_df._append(d, ignore_index=True)  # Merging the 2 dataset
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  103   Yasha   45
3  104   Mohan   38
4  105   Raghu   35

In [104]:
sample_df= sample_df.drop(2)   #Dropping rows as per index
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
3  104   Mohan   38
4  105   Raghu   35

In [106]:
sample_df= sample_df.reset_index(drop=True)        # To reset index
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35

sample_df= sample_df._append(d.ignore_index=True)

In [109]:
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35

In [111]:
a= {'id': 105,'name':'Raghu','age': 35}

In [115]:
sample_df= sample_df._append(a,ignore_index=True)

In [117]:
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35
4  105   Raghu   35

In [119]:
sample_df.drop_duplicates(ignore_index= True,inplace= True)   # To remove duplicates
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35

In [125]:
df1= pd.DataFrame({'id':[106,107,108],'name':['Disha','Rahul','Sam'],'age':[26,21,34]})
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35

In [129]:
sample_df['city']= ['Delhi','Mysore','Blore','West Bengal','Jammu','Tamilnadu']
sample_df

ValueError: Length of values (6) does not match length of index (4)

In [131]:
df1

    id   name  age
0  106  Disha   26
1  107  Rahul   21
2  108    Sam   34

In [135]:
sample_df= sample_df._append(df1,ignore_index=True)
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35
4  106   Disha   26
5  107   Rahul   21
6  108     Sam   34

In [139]:
sample_df['city']= ['Delhi','Mysore','Blore','West Bengal','Jammu','Tamilnadu','Waynad']
sample_df # To add new column in the dataset

    id    name  age         city
0  101    Amit   34        Delhi
1  102  Deepak   23       Mysore
2  104   Mohan   38        Blore
3  105   Raghu   35  West Bengal
4  106   Disha   26        Jammu
5  107   Rahul   21    Tamilnadu
6  108     Sam   34       Waynad

In [143]:
sample_df= sample_df.drop('city',axis=1) #To drope column from the dataset
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35
4  106   Disha   26
5  107   Rahul   21
6  108     Sam   34

In [151]:
sample_df.drop(columns=['name','age'],axis=1) # To drop multiple columns
sample_df

    id    name  age
0  101    Amit   34
1  102  Deepak   23
2  104   Mohan   38
3  105   Raghu   35
4  106   Disha   26
5  107   Rahul   21
6  108     Sam   34

In [157]:
sal_df= pd.DataFrame({'id': [101,102,103,104,105,106,107], 'city': ['Ajmer','Kashmir','Mysore','Davangere','Kerala','Hyderabad','Assam'], 'Salary':[3400,4500,6580,2357,8765,2908,4560]})

In [159]:
sal_df

    id       city  Salary
0  101      Ajmer    3400
1  102    Kashmir    4500
2  103     Mysore    6580
3  104  Davangere    2357
4  105     Kerala    8765
5  106  Hyderabad    2908
6  107      Assam    4560

In [161]:
type(sal_df)

pandas.core.frame.DataFrame

In [163]:
merged_df= pd.merge(sample_df,sal_df, on= 'id') # Merging the two table

In [165]:
merged_df

    id    name  age       city  Salary
0  101    Amit   34      Ajmer    3400
1  102  Deepak   23    Kashmir    4500
2  104   Mohan   38  Davangere    2357
3  105   Raghu   35     Kerala    8765
4  106   Disha   26  Hyderabad    2908
5  107   Rahul   21      Assam    4560

In [175]:
df= pd.read_csv(C:\Users\admin\Downloads\train.csv)

SyntaxError: invalid syntax (2441719817.py, line 1)